app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Not Found"], ["room_number", 404]]
---
    def create
        @class = SchoolClass.create(class_params)

SELECT "school_classes".* FROM "school_classes"
---
    def index
        @classes = SchoolClass.all

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_class
        @class = SchoolClass.find(params[:id])