app/controllers/students_controller.rb

UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Ro"], ["updated_at", "2021-04-27 19:28:37.007082"], ["id", 3]]
---
    def update
        find_student
        @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_student
        @student = Student.find(params[:id])